In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'a':np.random.randn(6),
                  'b':['foo','bar'] * 3,
                  'c':np.random.randn(6)})
df

          a    b         c
0 -0.286972  foo -0.728239
1 -0.510422  bar -0.334197
2  0.601187  foo -0.869561
3  0.446405  bar  0.780674
4 -0.897044  foo -0.755075
5  1.820638  bar  0.018233

In [3]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [4]:
df['a']

0   -0.286972
1   -0.510422
2    0.601187
3    0.446405
4   -0.897044
5    1.820638
Name: a, dtype: float64

In [5]:
df['b']

0    foo
1    bar
2    foo
3    bar
4    foo
5    bar
Name: b, dtype: object

In [7]:
df['d'] = range(6)

In [8]:
df

          a    b         c  d
0 -0.286972  foo -0.728239  0
1 -0.510422  bar -0.334197  1
2  0.601187  foo -0.869561  2
3  0.446405  bar  0.780674  3
4 -0.897044  foo -0.755075  4
5  1.820638  bar  0.018233  5

In [9]:
df['d'] = 5
df

          a    b         c  d
0 -0.286972  foo -0.728239  5
1 -0.510422  bar -0.334197  5
2  0.601187  foo -0.869561  5
3  0.446405  bar  0.780674  5
4 -0.897044  foo -0.755075  5
5  1.820638  bar  0.018233  5

In [11]:
test = np.tile(['foo','bar'],5)

In [12]:
test.shape

(10,)

In [13]:
test.dtype

dtype('<U3')

In [14]:
 df.index

RangeIndex(start=0, stop=6, step=1)

In [15]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [16]:
df[:3]

          a    b         c  d
0 -0.286972  foo -0.728239  5
1 -0.510422  bar -0.334197  5
2  0.601187  foo -0.869561  5

In [17]:
df[-2:]

          a    b         c  d
4 -0.897044  foo -0.755075  5
5  1.820638  bar  0.018233  5

In [18]:
df.xs(0)

a   -0.286972
b         foo
c   -0.728239
d           5
Name: 0, dtype: object

In [19]:
df.xs(2)

a    0.601187
b         foo
c   -0.869561
d           5
Name: 2, dtype: object

In [22]:
df.ix[0]

/usr/lib/python3/dist-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

a   -0.286972
b         foo
c   -0.728239
d           5
Name: 0, dtype: object

In [24]:
df.ix[2,'b']

/usr/lib/python3/dist-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

'foo'

In [29]:
df.get_value(0,'b')

/usr/lib/python3/dist-packages/ipykernel_launcher.py:1: FutureWarning: get_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.

'foo'

In [32]:
df.at[0,'b']

'foo'

In [33]:
df.ix[:,'b']

/usr/lib/python3/dist-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    foo
1    bar
2    foo
3    bar
4    foo
5    bar
Name: b, dtype: object

In [34]:
df.ix[:,['b','c']]

/usr/lib/python3/dist-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

     b         c
0  foo -0.728239
1  bar -0.334197
2  foo -0.869561
3  bar  0.780674
4  foo -0.755075
5  bar  0.018233

In [35]:
df[df['c']>0]

          a    b         c  d
3  0.446405  bar  0.780674  5
5  1.820638  bar  0.018233  5

In [37]:
df1 = pd.DataFrame({'a':np.random.randn(6),
                  'b':['foo','bar'] * 3,
                  'c':np.random.randn(6)},
                  index=pd.date_range('1/1/2000',periods=6))
df1

                   a    b         c
2000-01-01  0.470633  foo -1.115810
2000-01-02 -1.145702  bar  1.223262
2000-01-03 -1.216833  foo  1.984490
2000-01-04  0.307709  bar  0.400305
2000-01-05  0.804675  foo  0.096070
2000-01-06  1.022292  bar -1.835724

In [38]:
pd.date_range('1/1/2019', periods=57)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12',
               '2019-01-13', '2019-01-14', '2019-01-15', '2019-01-16',
               '2019-01-17', '2019-01-18', '2019-01-19', '2019-01-20',
               '2019-01-21', '2019-01-22', '2019-01-23', '2019-01-24',
               '2019-01-25', '2019-01-26', '2019-01-27', '2019-01-28',
               '2019-01-29', '2019-01-30', '2019-01-31', '2019-02-01',
               '2019-02-02', '2019-02-03', '2019-02-04', '2019-02-05',
               '2019-02-06', '2019-02-07', '2019-02-08', '2019-02-09',
               '2019-02-10', '2019-02-11', '2019-02-12', '2019-02-13',
               '2019-02-14', '2019-02-15', '2019-02-16', '2019-02-17',
               '2019-02-18', '2019-02-19', '2019-02-20', '2019-02-21',
               '2019-02-22', '2019-02-23', '2019-02-24', '2019-02-25',
               '2019-02-26'],
              dtype='datetime64[ns]', freq='D')

In [39]:
df2 =  pd.DataFrame({'a':np.random.randn(6),
                  'b':['foo','bar'] * 3,
                  'c':np.random.randn(6)},
                   columns=['a','b','c','d'])
df2

          a    b         c    d
0  0.087831  foo -0.871443  NaN
1 -1.720076  bar  0.249056  NaN
2  0.230678  foo -0.832353  NaN
3 -0.920023  bar -0.008159  NaN
4 -0.091551  foo -0.106366  NaN
5 -0.375313  bar  0.767019  NaN

In [40]:
pd.isnull(df2)

       a      b      c     d
0  False  False  False  True
1  False  False  False  True
2  False  False  False  True
3  False  False  False  True
4  False  False  False  True
5  False  False  False  True

In [42]:
abort = pd.read_csv('data/abortion_by_age.csv',index_col=0,parse_dates=True)

In [43]:
abort.head()

           Age_of_woman  Abortion_rate
Period
2000-01-01        11-14            0.7
2000-01-01        15-19           23.1
2000-01-01        20-24           35.7
2000-01-01        25-29           24.5
2000-01-01        30-34           16.4

In [44]:
abort

           Age_of_woman  Abortion_rate
Period
2000-01-01        11-14            0.7
2000-01-01        15-19           23.1
2000-01-01        20-24           35.7
2000-01-01        25-29           24.5
2000-01-01        30-34           16.4
...                 ...            ...
2018-01-01        25-29           19.3
2018-01-01        30-34           15.7
2018-01-01        35-39           10.9
2018-01-01        40-44            4.4
2018-01-01  45 and over            0.3

[152 rows x 2 columns]